#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.sc_database_connections.aws_dynamodb_table.table will be created
+ resource "aws_dynamodb_table" "table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "connectionId"
      + id               = (known after apply)
      + name             = "sc_connections_staging"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Database - connections"
          + "Tool"        = "Terraform"
        }
      + write_capacity   = 2

      + attribute {
          + name = "connectionId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled = true
        }
    }

  # module.sc_database_rooms.aws_dynamodb_table.table will be created
+ resource "aws_dynamodb_table" "table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "sc_rooms_staging"
      + range_key        = "connectionId"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Database - rooms"
          + "Tool"        = "Terraform"
        }
      + write_capacity   = 5

      + attribute {
          + name = "ID"
          + type = "S"
        }
      + attribute {
          + name = "connectionId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled = true
        }
    }

  # module.sc_lambda_onconnect.aws_lambda_function.lambda will be created
+ resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = ".out/lambda-api/onconnect.zip"
      + function_name                  = "sc_onconnect_staging"
      + handler                        = "app.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = []
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs10.x"
      + source_code_hash               = "+cGXNCP5jyDPFf9Fj+FRuiqsSE7IUaUqxvPx6CRhfCE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Lambda API - onconnect"
          + "Tool"        = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FUNCTION_NAME" = "sc_onconnect_staging"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sc_lambda_ondisconnect.aws_lambda_function.lambda will be created
+ resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = ".out/lambda-api/ondisconnect.zip"
      + function_name                  = "sc_ondisconnect_staging"
      + handler                        = "app.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs10.x"
      + source_code_hash               = "7HWO90/JtQS5ZEbQQ2xyATyGPKOaR/1EP+OHeCZCmzQ="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Lambda API - ondisconnect"
          + "Tool"        = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FUNCTION_NAME"          = "sc_ondisconnect_staging"
              + "TABLE_NAME_CONNECTIONS" = "sc_connections_staging"
              + "TABLE_NAME_ROOMS"       = "sc_rooms_staging"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sc_lambda_sendmessage.aws_lambda_function.lambda will be created
+ resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = ".out/lambda-api/sendmessage.zip"
      + function_name                  = "sc_sendmessage_staging"
      + handler                        = "app.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs10.x"
      + source_code_hash               = "yfOZDKbYXmO4MKw1g5QFnNrwb1/Z1hb0pEt/wcfScks="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Lambda API - sendmessage"
          + "Tool"        = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FUNCTION_NAME"          = "sc_sendmessage_staging"
              + "TABLE_NAME_CONNECTIONS" = "sc_connections_staging"
              + "TABLE_NAME_ROOMS"       = "sc_rooms_staging"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sc_layer_room_manager.aws_lambda_layer_version.lambda_layer will be created
+ resource "aws_lambda_layer_version" "lambda_layer" {
      + arn                 = (known after apply)
      + compatible_runtimes = [
          + "nodejs10.x",
        ]
      + created_date        = (known after apply)
      + filename            = ".out/lambda-layers/room_manager.zip"
      + id                  = (known after apply)
      + layer_arn           = (known after apply)
      + layer_name          = "sc_room_manager_staging"
      + source_code_hash    = "H0yzvUlsXni/0H9XgXDiXCyHkf8GtOeygCSmAp/Uxrs="
      + source_code_size    = (known after apply)
      + version             = (known after apply)
    }

  # module.sc_role_lambda_basic.aws_iam_role.role will be created
+ resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sc_lambda_basic_staging"
      + path                  = "/"
      + tags                  = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Role - lambda_basic"
          + "Tool"        = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.sc_role_lambda_basic.aws_iam_role_policy_attachment.policy-attachment[0] will be created
+ resource "aws_iam_role_policy_attachment" "policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "sc_lambda_basic_staging"
    }

  # module.sc_role_lambda_dynamo.aws_iam_role.role will be created
+ resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sc_lambda_dynamo_staging"
      + path                  = "/"
      + tags                  = {
          + "Application" = "Synchronous chess"
          + "Environment" = "staging"
          + "Name"        = "Role - lambda_dynamo"
          + "Tool"        = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.sc_role_lambda_dynamo.aws_iam_role_policy_attachment.policy-attachment[0] will be created
+ resource "aws_iam_role_policy_attachment" "policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "sc_lambda_dynamo_staging"
    }

  # module.sc_role_lambda_dynamo.aws_iam_role_policy_attachment.policy-attachment[1] will be created
+ resource "aws_iam_role_policy_attachment" "policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::404273159415:policy/sc-manage-tables-staging"
      + role       = "sc_lambda_dynamo_staging"
    }

  # module.sc_role_lambda_dynamo.aws_iam_role_policy_attachment.policy-attachment[2] will be created
+ resource "aws_iam_role_policy_attachment" "policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::404273159415:policy/sc-manage-connection-staging"
      + role       = "sc_lambda_dynamo_staging"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Angular CI Pull request Game App`, Action: `hashicorpterraform-github-actions3`*